In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame(np.random.randn(3,4), index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])
df

       Olma      Anor     Qovun     Anjir
a -1.209770  1.259302 -1.578947 -0.345210
b  0.084565  0.467613 -0.728747 -0.585746
c  1.652383 -0.693462  0.083155  0.755132

In [4]:
np.abs(-5)

np.int64(5)

In [5]:
np.round(df)

   Olma  Anor  Qovun  Anjir
a  -1.0   1.0   -2.0   -0.0
b   0.0   0.0   -1.0   -1.0
c   2.0  -1.0    0.0    1.0

In [6]:
df

       Olma      Anor     Qovun     Anjir
a -1.209770  1.259302 -1.578947 -0.345210
b  0.084565  0.467613 -0.728747 -0.585746
c  1.652383 -0.693462  0.083155  0.755132

In [7]:
df.mean()

Olma     0.175726
Anor     0.344484
Qovun   -0.741513
Anjir   -0.058608
dtype: float64

In [8]:
df.apply(np.abs)

       Olma      Anor     Qovun     Anjir
a  1.209770  1.259302  1.578947  0.345210
b  0.084565  0.467613  0.728747  0.585746
c  1.652383  0.693462  0.083155  0.755132

In [9]:
df.apply(sum, axis=1)

a   -1.874625
b   -0.762314
c    1.797208
dtype: float64

In [10]:
f = lambda x: x.max()-x.min()

In [11]:
df.apply(f)

Olma     2.862153
Anor     1.952764
Qovun    1.662103
Anjir    1.340877
dtype: float64

In [12]:
def foo(x):
  return pd.Series([x.min(),x.max()], index=['min','max'])

In [13]:
df = pd.DataFrame(np.arange(1,13).reshape(3,4),index=list('abc'), columns=['Olma','Anor','Qovun','Anjir'])

In [14]:
df

   Olma  Anor  Qovun  Anjir
a     1     2      3      4
b     5     6      7      8
c     9    10     11     12

In [15]:
df.applymap(lambda x: x*x)

C:\Users\user\AppData\Local\Temp\ipykernel_11472\3316139181.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x*x)

   Olma  Anor  Qovun  Anjir
a     1     4      9     16
b    25    36     49     64
c    81   100    121    144